blog-posts/2013-11-04-emacs-org-mode-customization-survey.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Emacs Org Mode Customization Survey</title>
<!-- 2014-04-30 Wed 17:43 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="../css/foundation.min.css"></link>
<link rel="stylesheet" type="text/css" href="../css/org-export.css"></link>
<link rel="stylesheet" type="text/css" href="../css/style.css"></link>
<link rel="stylesheet" type="text/css" href="../css/emacs-notes.css"></link>
</head>
<body>
<div id="content">
<h1 class="title">Emacs Org Mode Customization Survey</h1>
<p>
November 4th, 2013 -
<a href="http://sachachua.com/blog/p/26381"><a href="http://sachachua.com/blog/p/26381">http://sachachua.com/blog/p/26381</a></a>
</p>

<p>
<a href="http://www.orgmode.org">Org Mode</a> is an outlining and TODO tool for
Emacs. Except it's so much more than that, since people have written all
sorts of code to make it do way more than an outliner (or even a text
editor!) usually does. Seriously, it even has a Sudoku solver. (The code
is optional, so you don't lose memory if you don't load it.)
</p>

<p>
If you use Emacs and you haven't tried out Org Mode yet, check it out.
</p>

<p>
If you've made Org Mode a part of your life, you've probably customized
lots of little things about it. Please help the developers by submitting
the customization survey to Mike McLean!
</p>

<blockquote>
<p>
As discussed a few days ago on this list, Carsten and the other
developers are interested in what and how us users are customizing Org
mode. This was first done in 2009, so a re-do of the survey is useful
as is for how people are using Org now, as well as a comparison to the
past.
</p>

<p>
Carsten provided the function that was used before to collect the raw
data and I am working on the data collection and summarization this
time around.
</p>

<p>
I have place the function on Github,
<a href="https://github.com/SkydiveMike/org-customization-survey"><a href="https://github.com/SkydiveMike/org-customization-survey">https://github.com/SkydiveMike/org-customization-survey</a></a>
The raw elisp is at:
<a href="https://raw.github.com/SkydiveMike/org-customization-survey/master/org-customization-survey.el"><a href="https://raw.github.com/SkydiveMike/org-customization-survey/master/org-customization-survey.el">https://raw.github.com/SkydiveMike/org-customization-survey/master/org-customization-survey.el</a></a>
</p>

<p>
All you need to do is:
</p>
<ol class="org-ol">
<li>Load and eval the function
</li>
<li>Execute (interactive) org-customization-survey
</li>
<li>Review the buffer, cleanse for sensitive information if any
</li>
<li>Email the buffer to
</li>
</ol>
<p>
<a href="mailto:mike.mclean@pobox.com">mike.mclean@pobox.com</a> (If your Emacs
is configured for email, C-c C-c will send)
</p>
</blockquote>

<p>
I'm looking forward to the results, which will most likely be posted to
the <a href="http://orgmode.org/community.html">Org Mode mailing list</a>.
</p>

<p>
Curious about my Org configuration? Check out my
<a href="http://sachachua.com/blog/dotemacs">annotated Emacs config</a>.
</p>
</div>
<div id="postamble" class="status">
<div class="back-to-top"><a href="#top">Back to top</a> | <a href="mailto:sacha@sachachua.com">E-mail me</a></div>
</div>
</body>
</html>
